var products = [];
products[0] = { "施設": "ＡＡＡＡＡＡ中学校", "提供時間": "13:01:57", "食種": "ＡＡＡＡＡＡ", "予定食数1": 40, "調理実施数1": 40, "予定食数2": 40, "調理実施数2": 40, "予定食数3": 40, "調理実施数3": 40, "予定食数4": 40, "調理実施数4": 40, "予定食数5": 40, "調理実施数5": 38, "予定食数6": 40, "調理実施数6": 40, "予定食数7": 40, "調理実施数7": 39, "予定食数8": 40, "調理実施数8": 39 };
products[1] = { "施設": "ＢＢＢＢＢ小学校", "提供時間": "14:31:12", "食種": "ＢＢＢＢＢＢ", "予定食数1": 99, "調理実施数1": 99, "予定食数2": 99, "調理実施数2": 99, "予定食数3": 99, "調理実施数3": 99, "予定食数4": 99, "調理実施数4": 99, "予定食数5": 9, "調理実施数5": 98, "予定食数6": 99, "調理実施数6": 99, "予定食数7": 99, "調理実施数7": 99, "予定食数8": 99, "調理実施数8": 99 };
products[2] = { "施設": "ＣＣＣＣＣ中学校", "提供時間": "14:36:22", "食種": "ＣＣＣＣＣＣ", "予定食数1": 120, "調理実施数1": 120, "予定食数2": 120, "調理実施数2": 120, "予定食数3": 120, "調理実施数3": 120, "予定食数4": 120, "調理実施数4": 120, "予定食数5": 120, "調理実施数5": 120, "予定食数6": 120, "調理実施数6": 120, "予定食数7": 120, "調理実施数7": 120, "予定食数8": 120, "調理実施数8": 120 };
products[3] = { "施設": "ＤＤＤ小学校", "提供時間": "15:13:26", "食種": "ＤＤＤＤＤＤ", "予定食数1": 175, "調理実施数1": 175, "予定食数2": 175, "調理実施数2": 175, "予定食数3": 175, "調理実施数3": 175, "予定食数4": 175, "調理実施数4": 175, "予定食数5": 175, "調理実施数5": 175, "予定食数6": 175, "調理実施数6": 175, "予定食数7": 175, "調理実施数7": 175, "予定食数8": 175, "調理実施数8": 175 };
products[4] = { "施設": "ＥＥＥＥＥ中学校", "提供時間": "14:36:22", "食種": "ＥＥＥ", "予定食数1": 246, "調理実施数1": 246, "予定食数2": 246, "調理実施数2": 246, "予定食数3": 246, "調理実施数3": 246, "予定食数4": 246, "調理実施数4": 246, "予定食数5": 246, "調理実施数5": 243, "予定食数6": 246, "調理実施数6": 246, "予定食数7": 246, "調理実施数7": 246, "予定食数8": 246, "調理実施数8": 246 };
products[5] = { "施設": "ＦＦＦＦ小学校", "提供時間": "15:13:26", "食種": "ＤＤＤＤ", "予定食数1": 325, "調理実施数1": 325, "予定食数2": 325, "調理実施数2": 325, "予定食数3": 325, "調理実施数3": 325, "予定食数4": 325, "調理実施数4": 324, "予定食数5": 325, "調理実施数5": 325, "予定食数6": 325, "調理実施数6": 325, "予定食数7": 325, "調理実施数7": 325, "予定食数8": 325, "調理実施数8": 325 };
products[6] = { "施設": "ＧＧ小学校", "提供時間": "15:13:26", "食種": "ＦＦ", "予定食数1": 225, "調理実施数1": 225, "予定食数2": 225, "調理実施数2": 225, "予定食数3": 225, "調理実施数3": 225, "予定食数4": 225, "調理実施数4": 225, "予定食数5": 225, "調理実施数5": 225, "予定食数6": 225, "調理実施数6": 225, "予定食数7": 225, "調理実施数7": 225, "予定食数8": 225, "調理実施数8": 225 };
products[7] = { "施設": "ＨＨＨＨ小学校", "提供時間": "15:13:26", "食種": "ＨＨＨＨ", "予定食数1": 220, "調理実施数1": 220, "予定食数2": 220, "調理実施数2": 220, "予定食数3": 220, "調理実施数3": 220, "予定食数4": 220, "調理実施数4": 220, "予定食数5": 220, "調理実施数5": 220, "予定食数6": 220, "調理実施数6": 220, "予定食数7": 220, "調理実施数7": 220, "予定食数8": 220, "調理実施数8": 220 };

$.ig.loader({
    scriptPath: "../../Scripts/",
    cssPath: "../../Content/",
    resources: "igGrid.Updating.MultiColumnHeaders"
});

$.ig.loader(function () {
    $("#grid1").igGrid({
        primaryKey: "施設",
        height: "300px",
        width: "1200px",
        autoGenerateColumns: false,
        editMode: "Cell",
        columns: [
            { headerText: "施設", key: "施設", dataType: "string", width: "160px" },
            { headerText: "提供時間", key: "提供時間", dataType: "string", width: "80px" },
            { headerText: "食種", key: "食種", dataType: "string", width: "100px" },
            { headerText: "08/01（木）",
                group:[
                { headerText: "予定食数", key: "予定食数1", dataType: "number", width: "60px" },
                { headerText: "調理実施数", key: "調理実施数1", dataType: "number", width: "60px" }
            ]
            },
            { headerText: "08/02（金）",
                group:[
                { headerText: "予定食数", key: "予定食数2", dataType: "number", width: "60px" },
                { headerText: "調理実施数", key: "調理実施数2", dataType: "number", width: "60px" }
            ]
            },
            { headerText: "08/05（月）",
                group:[
                { headerText: "予定食数", key: "予定食数3", dataType: "number", width: "60px" },
                { headerText: "調理実施数", key: "調理実施数3", dataType: "number", width: "60px" }
            ]
            },
            { headerText: "08/06（火）",
                group:[
                { headerText: "予定食数", key: "予定食数4", dataType: "number", width: "60px" },
                { headerText: "調理実施数", key: "調理実施数4", dataType: "number", width: "60px" }
            ]
            },
            { headerText: "08/07（水）",
                group:[
                { headerText: "予定食数", key: "予定食数5", dataType: "number", width: "60px" },
                { headerText: "調理実施数", key: "調理実施数5", dataType: "number", width: "60px" }
            ]
            },
            { headerText: "08/08（木）",
                group:[
                { headerText: "予定食数", key: "予定食数6", dataType: "number", width: "60px" },
                { headerText: "調理実施数", key: "調理実施数6", dataType: "number", width: "60px" }
            ]
            },
            { headerText: "08/09（金）",
                group:[
                { headerText: "予定食数", key: "予定食数7", dataType: "number", width: "60px" },
                { headerText: "調理実施数", key: "調理実施数7", dataType: "number", width: "60px" }
            ]
            },
            { headerText: "08/12（月）",
                group: [
                { headerText: "予定食数", key: "予定食数8", dataType: "number", width: "60px" },
                { headerText: "調理実施数", key: "調理実施数8", dataType: "number", width: "60px" }
            ]
            },

        ],
            dataSource: products,
            features: [
        {
            name: 'MultiColumnHeaders'
        },
    ]
        });
});