var products = [];
products[0] = { "施設": "ＡＡＡＡＡ学校", "確認者1": "00000001 04月22日 13:01", "確認者2": "00100001 04月22日 15:01", "初回日1": "05月22日 13:01", "最終日1": "05月22日 13:45", "回数1": 69, "初回日2": "08月22日 13:01", "最終日2": "08月22日 13:01", "回数2": 1, "初回日3": "08月22日 13:01", "最終日3": "08月22日 13:01", "回数3": 101 };
products[1] = { "施設": "ＢＢＢＢＢＢ学校", "確認者1": "00000002 08月12日 15:11", "確認者2": "00100002 08月22日 17:01", "初回日1": "08月23日 10:05", "最終日1": "08月25日 12:01", "回数1": 69, "初回日2": "08月22日 13:01", "最終日2": "08月22日 13:01", "回数2": 1, "初回日3": "08月22日 13:01", "最終日3": "08月22日 13:01", "回数3": 101 };
products[2] = { "施設": "ＣＣＣ学校", "確認者1": "00000003 10月07日 08:33", "確認者2": "00100003 10月08日 10:51", "初回日1": "11月11日 12:12", "最終日1": "11月13日 12:59", "回数1": 69, "初回日2": "08月22日 13:01", "最終日2": "08月22日 13:01", "回数2": 1, "初回日3": "08月22日 13:01", "最終日3": "08月22日 13:01", "回数3": 101 };
products[3] = { "施設": "ＤＤＤＤ学校", "確認者1": "00000004 12月03日 10:56", "確認者2": "00100004 12月05日 13:01", "初回日1": "12月10日 16:43", "最終日1": "12月12日 18:01", "回数1": 69, "初回日2": "08月22日 13:01", "最終日2": "08月22日 13:01", "回数2": 1, "初回日3": "08月22日 13:01", "最終日3": "08月22日 13:01", "回数3": 101 };
products[4] = { "施設": "ＥＥＥＥ学校", "確認者1": "00000005 12月03日 10:56", "確認者2": "00100005 12月05日 13:01", "初回日1": "12月10日 16:43", "最終日1": "12月12日 18:01", "回数1": 69, "初回日2": "08月22日 13:01", "最終日2": "08月22日 13:01", "回数2": 1, "初回日3": "08月22日 13:01", "最終日3": "08月22日 13:01", "回数3": 101 };
products[5] = { "施設": "ＦＦＦＦＦ学校", "確認者1": "00000006 12月03日 10:56", "確認者2": "00200001 12月05日 13:01", "初回日1": "12月10日 16:43", "最終日1": "12月12日 18:01", "回数1": 69, "初回日2": "08月22日 13:01", "最終日2": "08月22日 13:01", "回数2": 1, "初回日3": "08月22日 13:01", "最終日3": "08月22日 13:01", "回数3": 101 };
products[6] = { "施設": "ＧＧＧＧＧＧ学校", "確認者1": "00000007 12月03日 10:56", "確認者2": "00200002 12月05日 13:01", "初回日1": "12月10日 16:43", "最終日1": "12月12日 18:01", "回数1": 69, "初回日2": "08月22日 13:01", "最終日2": "08月22日 13:01", "回数2": 1, "初回日3": "08月22日 13:01", "最終日3": "08月22日 13:01", "回数3": 101 };
products[7] = { "施設": "ＨＨＨ学校", "確認者1": "00000008 12月03日 10:56", "確認者2": "00300001 12月05日 13:01", "初回日1": "12月10日 16:43", "最終日1": "12月12日 18:01", "回数1": 69, "初回日2": "08月22日 13:01", "最終日2": "08月22日 13:01", "回数2": 1, "初回日3": "08月22日 13:01", "最終日3": "08月22日 13:01", "回数3": 101 };
products[8] = { "施設": "ＩＩＩＩＩ学校", "確認者1": "00000009 12月03日 10:56", "確認者2": "00400001 12月05日 13:01", "初回日1": "12月10日 16:43", "最終日1": "12月12日 18:01", "回数1": 69, "初回日2": "08月22日 13:01", "最終日2": "08月22日 13:01", "回数2": 1, "初回日3": "08月22日 13:01", "最終日3": "08月22日 13:01", "回数3": 101 };
products[9] = { "施設": "ＨＨＨ学校", "確認者1": "00000008 12月03日 10:56", "確認者2": "00300001 12月05日 13:01", "初回日1": "12月10日 16:43", "最終日1": "12月12日 18:01", "回数1": 69, "初回日2": "08月22日 13:01", "最終日2": "08月22日 13:01", "回数2": 1, "初回日3": "08月22日 13:01", "最終日3": "08月22日 13:01", "回数3": 101 };
products[10] = { "施設": "ＩＩＩＩＩ学校", "確認者1": "00000009 12月03日 10:56", "確認者2": "00400001 12月05日 13:01", "初回日1": "12月10日 16:43", "最終日1": "12月12日 18:01", "回数1": 69, "初回日2": "08月22日 13:01", "最終日2": "08月22日 13:01", "回数2": 1, "初回日3": "08月22日 13:01", "最終日3": "08月22日 13:01", "回数3": 101 };

$.ig.loader({
    scriptPath: "../../Scripts/",
    cssPath: "../../Content/",
    resources: "igGrid.MultiColumnHeaders"
});

$.ig.loader(function () {
    $("#Grid1").live("iggridrendered", function (event, args) {
        // right-justify text in the third column 
        args.owner.element.find("tr td:nth-child(6)").css("text-align", "right");
        args.owner.element.find("tr td:nth-child(9)").css("text-align", "right");
        args.owner.element.find("tr td:nth-child(12)").css("text-align", "right");
    });

    $("#Grid1").igGrid({
        primaryKey: "施設",
        // height: "300px",
        // width: "1150px",
        height: "300px",
        width: "100%",

        autoGenerateColumns: false,
        columns: [
            { headerText: "施設", key: "施設", dataType: "string", width: "100px" },
            { headerText: "担当者", key: "確認者1", dataType: "string", width: "200px" },
            { headerText: "責任者", key: "確認者2", dataType: "string", width: "200px" },
            { headerText: "副食報告",
                group: [
                 { headerText: "初回日", key: "初回日1", dataType: "string", width: "120px" },
                 { headerText: "最終日", key: "最終日1", dataType: "string", width: "120px" },
                 { headerText: "回数", key: "回数1", dataType: "number", width: "50px" }
            ]
            },
            { headerText: "牛乳発注（メール）",
                group: [
                 { headerText: "初回日", key: "初回日2", dataType: "string", width: "120px" },
                 { headerText: "最終日", key: "最終日2", dataType: "string", width: "120px" },
                 { headerText: "回数", key: "回数2", dataType: "number", width: "50px" }
            ]
            },
            { headerText: "主食発注（メール）",
                group: [
                 { headerText: "初回日", key: "初回日3", dataType: "string", width: "120px" },
                 { headerText: "最終日", key: "最終日3", dataType: "string", width: "120px" },
                 { headerText: "回数", key: "回数3", dataType: "number", width: "60px" }
            ]
            },
        ],
        dataSource: products,
        features: [
        {
            name: 'MultiColumnHeaders'

        },
    ]
    });
});