var products = [];
products[0] = { "ログイン日時": "2013-08-15 13:01:57", "ログインIPアドレス": "111.111.111.111", "ログインＩＤ": "S00001", "ログインパスワード": "sss111ppp111", "ログイン成否": "1" };
products[1] = { "ログイン日時": "2013-08-16 09:38:29", "ログインIPアドレス": "222.222.222.222", "ログインＩＤ": "S00022", "ログインパスワード": "sss222ppp222", "ログイン成否": "9" };
products[2] = { "ログイン日時": "2013-08-17 10:24:31", "ログインIPアドレス": "333.333.333.333", "ログインＩＤ": "S00333", "ログインパスワード": "sss333ppp333", "ログイン成否": "1" };
products[3] = { "ログイン日時": "2013-08-19 14:12:43", "ログインIPアドレス": "444.444.444.444", "ログインＩＤ": "S04444", "ログインパスワード": "sss444ppp444", "ログイン成否": "1" };
products[4] = { "ログイン日時": "2013-08-19 14:12:43", "ログインIPアドレス": "555.555.555.555", "ログインＩＤ": "S05555", "ログインパスワード": "sss555ppp555", "ログイン成否": "1" };
products[5] = { "ログイン日時": "2013-08-19 14:12:43", "ログインIPアドレス": "666.666.666.666", "ログインＩＤ": "S00066", "ログインパスワード": "sss666ppp666", "ログイン成否": "1" };
products[6] = { "ログイン日時": "2013-08-19 14:12:43", "ログインIPアドレス": "777.777.777.777", "ログインＩＤ": "S00007", "ログインパスワード": "sss777ppp777", "ログイン成否": "1" };
products[7] = { "ログイン日時": "2013-08-19 14:12:43", "ログインIPアドレス": "888.888.888.888", "ログインＩＤ": "S00888", "ログインパスワード": "sss888ppp888", "ログイン成否": "1" };
products[8] = { "ログイン日時": "2013-08-19 14:12:43", "ログインIPアドレス": "999.999.999.999", "ログインＩＤ": "S00099", "ログインパスワード": "sss999ppp999", "ログイン成否": "1" };
products[9] = { "ログイン日時": "2013-08-19 14:12:43", "ログインIPアドレス": "000.000.000.000", "ログインＩＤ": "S00000", "ログインパスワード": "sss000ppp000", "ログイン成否": "1" };

$.ig.loader({
    scriptPath: "../../Scripts/",
    cssPath: "../../Content/",
    resources: "igGrid.Updating"
});

$.ig.loader(function () {
    $("#grid1").igGrid({
        primaryKey: "ログイン日時",
        height: "300px",
        width: "1000px",
        autoGenerateColumns: false,
        editMode: "Cell",
        columns: [
            { headerText: "ログイン日時", key: "ログイン日時", dataType: "string", width: "220px" },
            { headerText: "ログインIPアドレス", key: "ログインIPアドレス", dataType: "string", width: "220px" },
            { headerText: "ログインＩＤ", key: "ログインＩＤ", dataType: "string", width: "250px" },
            { headerText: "ログインパスワード", key: "ログインパスワード", dataType: "string", width: "220px" },
            { headerText: "ログイン成否", key: "ログイン成否", dataType: "string", width: "150px" },
        ],
        dataSource: products,
        features: [
        {
        }
    ]
    });
});